// Generic Button Titles

// UI guidelines state that "Yes" and "No" should not be used in dialogs. So don't use them.
// "YES" = "Yes";
// "NO" = "No";

OK          = "OK";
OK_REPLY    = "OK";     // Use this to avoid ambiguity when localization is missing.
CANCEL      = "Zrušiť";
CONTINUE    = "Pokračovať";
DONE        = "Hotovo";

/* Photo Stream account Setup */
PHOTO_STREAM_SETUP_ALERT_TITLE = "Fotostream";
PHOTO_STREAM_SETUP_ALERT_MESSAGE = "Vďaka fotostreamu sú vaše fotky automaticky dostupné na všetkých vašich zariadeniach. Fotostream môžete zapnúť v nastaveniach.";
PHOTO_STREAM_SETUP_LATER_BUTTON_TITLE = "Neskôr";
PHOTO_STREAM_SETUP_SETTINGS_BUTTON_TITLE = "Nastavenia";


/* Repeat pref */
"REPEAT" = "Opakovať";

/* Shuffle pref */
"SHUFFLE" = "Zamiešať";

/* Albums list title */
"ALBUMS" = "Albumy";

/* Tab titles */
"ALBUMS_TAB" = "Albumy";
"EVENTS_TAB" = "Udalosti";
"FACES_TAB"  = "Tváre";
"PLACES_TAB"  = "Miesta";
"IMPORT_TAB" = "Importovať";

/* Format for album image count */
"ALBUM_IMAGE_COUNT_FORMAT" = "Fotky: %@";
"ALBUM_VIDEO_COUNT_FORMAT" = "Videá: %@";
"ALBUM_OTHER_COUNT_FORMAT" = "Položiek: %@";

"1_ALBUM_IMAGE" = "1 fotka";
"1_ALBUM_VIDEO" = "1 video";
"1_ALBUM_OTHER" = "1 položka";
"ALBUM_ITEMS_COUNT_FORMAT" = "%@, %@";

ALBUM_THREE_TYPES_LABEL_COMMAS  = "%@, %@, %@";
ALBUM_TWO_TYPES_LABEL_COMMAS    = "%@, %@";
ALBUM_THREE_TYPES_LABEL_CONJUNCTION  = "%@, %@ a %@";
ALBUM_TWO_TYPES_LABEL_CONJUNCTION    = "%@ a %@";
ALBUM_ZERO_TYPES_LABEL   = "Žiadne položky";         // Not displayed in normal conditions.

/* Message prompting whether to display slideshow on TV or not */
"DISPLAY_ON_TV" = "Zobraziť na TV?";

/* Text for graphic displayed in content area when a video is being played on an external display */
"TVOUT_PLACEHOLDER_TITLE"    = "TV pripojené";
"TVOUT_PLACEHOLDER_SUBTITLE" = "Toto video sa prehráva na TV.";

/* Format string for scrub overlay */
"PHOTO_TITLE_FORMAT" = "%1$@ z %2$@";

/* Format string for number of images remaining in camera */
"PICTURES_REMAINING_FORMAT" = "%d zostáva";

/* Setting for no music */
"Off" = "Vyp.";

/* Setting for no music */
"NowPlaying" = "Práve hrá";

/* Setting for playing whatever iPhoto set */
"FromIPhoto" = "Z iPhoto";

/* Title for contact photo selection */
"CONTACT_PHOTO_TITLE_FORMAT" = "Takto to bude vyzerať, keď zavolá „%@“.";

/* Capturing HUD */
"CAPTURING" = "Zachytáva sa";

/* Retake button in crop overlay */
"RETAKE" = "Zopakovať";

/* Use (Done) button in crop overlay */
"USE" = "Použiť";

/* Subtitle for contact photo selection */
"CONTACT_PHOTO_SUBTITLE" = "Posunutie a veľkosť";

/* Title for cropping photo selection */
"CROP_OVERLAY_TITLE" = "Posunutie a veľkosť";

/* Title for cropping wallpaper selection */
"WALLPAPER_OVERLAY_TITLE" = "Posunutie a veľkosť";

/* Title for cropping photo selection */
"CROP_OVERLAY_SUBTITLE" = "";

/* Title for non-editing photo selection */
"PREVIEW" = "Náhľad";

/* Title for wallpaper photo selection */
"WALLPAPER_PHOTO_TITLE" = "Náhľad pozadia";

/* Title of button to set contact photo */
"SET_PHOTO_BUTTON" = "Priradiť";

"CHOOSE_PHOTO_BUTTON" = "Vybrať";

"USE_PHOTO_BUTTON" = "Použiť";

/* Title of button to set wallpaper */
"SET_WALLPAPER_BUTTON" = "Nastaviť";

/*** Sharing and Action Button Labels ***/
// a. Displayed in the Action popup menu in photo view.
// b. Displayed in the Share popup menu in album view on iPhone.

SEND_VIA_EMAIL_BUTTON       = "Odoslať emailom";
    // Note: Generic case used in the Share menu in the album view on iPhone.

SEND_PHOTO_VIA_EMAIL_BUTTON = "Odoslať emailom";
SEND_VIDEO_VIA_EMAIL_BUTTON = "Odoslať video emailom";

TEXT_MESSAGE                = "Správa";

SEND_TO_MOBILE_ME           = "Odoslať na MobileMe";
SEND_TO_YOUTUBE             = "Odoslať na YouTube";
TWEET                       = "Tweet";

ASSIGN_TO_CONTACT_BUTTON    = "Priradiť ku kontaktu";
USE_AS_SCREENSAVER_BUTTON   = "Použiť ako pozadie";
ROTATE_PHOTO                = "Otočiť fotku";

COPY_PHOTO_ACTION           = "Kopírovať fotku";
COPY_VIDEO_ACTION           = "Kopírovať video";
PRINT                       = "Tlačiť";


/*** ***/

/* Title of button to set screensaver */
"SET_SCREENSAVER_BUTTON" = "Použiť";

/* Status shown while setting wallpaper */
"SETTING_WALLPAPER" = "Nastavuje sa pozadie";

/* Strings for lack of Mail setup */
"NO_EMAIL_TITLE" = "Emailový účet";

"NO_EMAIL_ACCOUNT_FOR_PHOTOS_OR_VIDEOS" = "Pre odosielanie fotiek alebo videí si nastavte emailový účet.";
"NO_EMAIL_ACCOUNT_FOR_PHOTOS" = "Pre odosielanie fotiek si nastavte emailový účet.";
"NO_EMAIL_ACCOUNT_FOR_VIDEOS" = "Pre odosielanie videí si nastavte emailový účet.";

/* Button tile for lack of Mail setup */
"SET_UP_MAIL_ACCOUNT" = "Nastaviť";

/* Status shown while saving video */
"SAVING_VIDEO" = "Ukladá sa Video";

/* Status shown while saving picture */
"SAVING_PHOTO" = "Ukladá sa fotka";

/* Status shown while loading picture */
"LOADING_PHOTO" = "Načítava sa…";

/* Label under spinner while camera loads */
"CAMERA_LOADING" = "Načítava sa…";

/* EXIF TIFF Model */
"TIFFMAKE" = "Apple";

/* EXIF TIFF Make */
"TIFFMODEL_IPHONE" = "iPhone";
"TIFFMODEL_IPOD" = "iPod";

/* Title shown for empty photo album - photo mode */
"NO_PHOTOS" = "Žiadne fotky";

/* Title shown for empty photo album - video mode */
"NO_VIDEOS" = "Žiadne videá";

/* Title shown for empty photo album - both */
"NO_PHOTOS_VIDEOS" = "Žiadne fotky alebo videá";

/* Title for empty camera album - */
"CAMERA_ROLL_LOCKED_iPhone" = "Váš iPhone je zamknutý.";
"CAMERA_ROLL_LOCKED_iPod touch" = "Váš iPod je zamknutý.";
"CAMERA_ROLL_LOCKED_iPad" = "Váš iPad je zamknutý.";
"CAMERA_ROLL_LOCKED_iPhone Simulator" = "Váš iPhone je zamknutý.";
"CAMERA_ROLL_LOCKED_iPad Simulator" = "Váš iPad je zamknutý.";

/* Message for empty camera album - photo mode */
"EMPTY_CAMERA_ROLL_PHOTOS" = "Fotiť môžete pomocou fotoaparátu.";

/* Message for empty camera album - video mode */
"EMPTY_CAMERA_ROLL_VIDEOS" = "Pomocou fotoaparátu môžete natáčať videá.";

/* Message for empty camera album - both */
"EMPTY_CAMERA_ROLL_ALL" = "Pomocou fotoaparátu môžete fotiť alebo natáčať videá.";

/* Message for empty lock screen camera album */
"EMPTY_CAMERA_ROLL_LOCKED_MESSAGE_iPhone" = "Pre zobrazenie všetkých vašich fotiek a videí odomknite iPhone.";
"EMPTY_CAMERA_ROLL_LOCKED_MESSAGE_iPod touch" = "Pre zobrazenie všetkých vašich fotiek a videí odomknite iPod.";
"EMPTY_CAMERA_ROLL_LOCKED_MESSAGE_iPad" = "Pre zobrazenie všetkých vašich fotiek a videí odomknite iPad.";
"EMPTY_CAMERA_ROLL_LOCKED_MESSAGE_iPhone Simulator" = "Pre zobrazenie všetkých vašich fotiek a videí odomknite iPhone.";
"EMPTY_CAMERA_ROLL_LOCKED_MESSAGE_iPad Simulator" = "Pre zobrazenie všetkých vašich fotiek a videí odomknite iPad.";

/* Message for empty photo album */
"EMPTY_ALBUM_CAMERA_NOT_AVAILABLE_iPhone" = "Fotky a videá môžete synchronizovať na váš iPhone pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_CAMERA_NOT_AVAILABLE_iPod touch" = "Fotky a videá môžete synchronizovať na váš iPod pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_CAMERA_NOT_AVAILABLE_iPad" = "Fotky a videá môžete synchronizovať na váš iPad pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_CAMERA_NOT_AVAILABLE_iPhone Simulator" = "Fotky a videá môžete synchronizovať na váš iPhone pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_CAMERA_NOT_AVAILABLE_iPad Simulator" = "Fotky a videá môžete synchronizovať na váš iPad pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";

/* Message for empty photo album when a camera is available */
"EMPTY_ALBUM_CAMERA_AVAILABLE_iPhone" = "Fotky môžete nasnímať pomocou fotoaparátu, fotky a videá môžete synchronizovať na iPhone pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_CAMERA_AVAILABLE_iPod touch" = "Fotky môžete nasnímať pomocou fotoaparátu, fotky a videá môžete synchronizovať na iPod pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_CAMERA_AVAILABLE_iPad" = "Fotky môžete nasnímať pomocou fotoaparátu, fotky a videá môžete synchronizovať ich na iPad pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_CAMERA_AVAILABLE_iPhone Simulator" = "Fotky môžete nasnímať pomocou fotoaparátu, fotky a videá môžete synchronizovať na iPhone pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_CAMERA_AVAILABLE_iPad Simulator" = "Fotky môžete nasnímať pomocou fotoaparátu, fotky a videá môžete synchronizovať ich na iPad pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";

/* Message for empty photo album when a video is available */
"EMPTY_ALBUM_VIDEO_AVAILABLE_iPhone" = "Fotky a videá môžete nasnímať pomocou kamery, synchronizovať ich na iPhone pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_VIDEO_AVAILABLE_iPod touch" = "Fotky a videá môžete nasnímať pomocou kamery, synchronizovať ich na váš iPod pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_VIDEO_AVAILABLE_iPad" = "Fotky a videá môžete nasnímať pomocou kamery, synchronizovať ich na iPad pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_VIDEO_AVAILABLE_iPhone Simulator" = "Fotky a videá môžete nasnímať pomocou kamery, synchronizovať ich na iPhone pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";
"EMPTY_ALBUM_VIDEO_AVAILABLE_iPad Simulator" = "Fotky a videá môžete nasnímať pomocou kamery, synchronizovať ich na iPad pomocou iTunes, prípadne ich môžete pridať z iných albumov a udalostí.";

/* Message for empty photo stream album */
"EMPTY_ALBUM_PHOTO_STREAM" = "Fotostream odosiela a ukladá fotografie za posledných 30 dní na iCloud a sťahuje ich do všetkých vašich zariadení.";

/* Message for empty photo album when there is no content in the library */
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_NOT_AVAILABLE_iPhone" = "Fotky a videá môžete synchronizovať na váš iPhone pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_NOT_AVAILABLE_iPod touch" = "Fotky a videá môžete synchronizovať na váš iPod pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_NOT_AVAILABLE_iPad" = "Fotky a videá môžete synchronizovať na váš iPad pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_NOT_AVAILABLE_iPhone Simulator" = "Fotky a videá môžete synchronizovať na váš iPhone pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_NOT_AVAILABLE_iPad Simulator" = "Fotky a videá môžete synchronizovať na váš iPad pomocou iTunes.";

/* Message for empty photo album when a camera is available and there is no content in the library */
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_AVAILABLE_iPhone" = "Fotiť a natáčať videá môžete pomocou fotoaparátu, alebo môžete fotky a videá synchronizovať na iPhone pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_AVAILABLE_iPod touch" = "Fotiť môžete pomocou fotoaparátu, alebo môžete fotky a synchronizovať na iPod pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_AVAILABLE_iPad" = "Fotiť môžete pomocou fotoaparátu, alebo môžete fotky a synchronizovať na iPad pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_AVAILABLE_iPhone Simulator" = "Fotiť a natáčať videá môžete pomocou fotoaparátu, alebo môžete fotky a videá synchronizovať na iPhone pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_AVAILABLE_iPad Simulator" = "Fotiť môžete pomocou fotoaparátu, alebo môžete fotky a synchronizovať na iPad pomocou iTunes.";

/* Message for empty photo album when a video is available and there is no content in the library */
"EMPTY_ALBUM_EMPTY_LIBRARY_VIDEO_AVAILABLE_iPhone" = "Fotiť a natáčať videá môžete pomocou fotoaparátu, alebo môžete fotky a videá synchronizovať na iPhone pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_VIDEO_AVAILABLE_iPod touch" = "Fotiť a natáčať videá môžete pomocou fotoaparátu, alebo môžete fotky a videá synchronizovať na iPod pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_VIDEO_AVAILABLE_iPad" = "Fotiť a natáčať videá môžete pomocou fotoaparátu, alebo môžete fotky a videá synchronizovať na iPad pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_VIDEO_AVAILABLE_iPhone Simulator" = "Fotiť a natáčať videá môžete pomocou fotoaparátu, alebo môžete fotky a videá synchronizovať na iPhone pomocou iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_VIDEO_AVAILABLE_iPad Simulator" = "Fotiť a natáčať videá môžete pomocou fotoaparátu, alebo môžete fotky a videá synchronizovať na iPad pomocou iTunes.";

/* Message when there's not enough disk space */
"LOW_DISK_SPACE_TITLE" = "Nedostatok miesta na disku";
"LOW_DISK_SPACE_PHOTO_TITLE" = "Nedá sa spraviť fotka";
"LOW_DISK_SPACE_VIDEO_TITLE" = "Nie je možné nahrávať video";
"LOW_DISK_SPACE_TRIM_TITLE" = "Nie je možné orezať video";
"LOW_DISK_SPACE_PHOTO_BODY" = "Nemáte dostatok úložiska pre fotografovanie. Úložisko môžete spravovať v Nastaveniach.";
"LOW_DISK_SPACE_VIDEO_BODY" = "Nemáte dostatok úložiska pre nahrávanie videa. Úložisko môžete spravovať v Nastaveniach.";
"LOW_DISK_SPACE_TRIM_BODY" = "Nemáte dostatok úložiska pre orezávanie videa. Úložisko môžete spravovať v Nastaveniach.";
"LOW_DISK_SPACE_NO_SETTINGS_PHOTO_BODY" = "Nemáte dostatok úložiska pre fotografovanie.";
"LOW_DISK_SPACE_NO_SETTINGS_VIDEO_BODY" = "Nemáte dostatok úložiska pre nahrávanie videa.";
"LOW_DISK_SPACE_NO_SETTINGS_TRIM_BODY" = "Nemáte dostatok úložiska pre orezanie videa.";
"LOW_DISK_SPACE_ALERT_SETTINGS_TITLE" = "Nastavenia";
"LOW_DISK_SPACE_ALERT_DONE_TITLE" = "Hotovo";
"LOW_DISK_SPACE_NO_SETTINGS_ALERT_DONE_TITLE" = "OK";

/* Recording stopped resons */
"RECORDING_STOPPED_TITLE" = "Nahrávanie videa zastavené";
"MAX_RECORDING_DURATION_REACHED"  = "Bola dosiahnutá maximálna dĺžka pre toto video.";
"MAX_RECORDING_FILE_SIZE_REACHED" = "Bola dosiahnutá maximálna veľkosť pre toto video."; 

"MOBILE_ME_SERVICE_NAME" = "MobileMe";

/* Crop overlay title */
"TAKE_PICTURE" = "Odfotiť";

// ***

"FLASH_DISABLED_TITLE"    = "Blesk je vypnutý";
"FLASH_DISABLED_MESSAGE_iPhone"  = "iPhone sa potrebuje pred použitím blesku ochladiť.";
"FLASH_DISABLED_MESSAGE_iPod touch" = "iPod sa potrebuje pred použitím blesku ochladiť.";
"FLASH_DISABLED_MESSAGE_iPad"  = "iPad sa potrebuje pred použitím blesku ochladiť.";

"VIDEO_INCOMPATIBLE_ERROR" = "Operácia zlyhala, pretože video je nekompatibilné s albumom Fotoaparát tohto zariadenia.";

/* Titles for segments for camera album sheet */
"CAMERA_ALBUM_SEGMENT_ALL" = "Všetky";
"CAMERA_ALBUM_SEGMENT_PHOTOS" = "Fotky";
"CAMERA_ALBUM_SEGMENT_VIDEO" = "Videá";

"TRIM_ACTION_TITLE" = "Orezať";

"TRIM_BUTTON_TITLE" = "Orezať";
"PUBLISH_BUTTON_TITLE" = "Zverejniť";

"APPROXIMATE_SIZE" = "(≈%@)";

"MEDIA_PROGRESS_NO_TIME_FORMAT" = "Zverejňuje sa na %@";
"MEDIA_PROGRESS_FORMAT" = "Zverejňuje sa na %@: %@";
"MEDIA_TIME_MINUTES_REMAINING_FORMAT" = "Zostáva približne %d min…";
"MEDIA_TIME_ONE_MINUTE_REMAINING" = "Zostáva približne 1 min…";
"MEDIA_TIME_SECONDS_REMAINING_FORMAT" = "Zostáva približne %d s…";
"MEDIA_TIME_ONE_SECOND_REMAINING" = "Zostáva približne 1 s…";
"COMPLETING_UPLOAD" = "Dokončuje sa odosielanie…";

TRIMMING_VIDEO      = "Orezáva sa video…";
PREPARING_VIDEO     = "Pripravuje sa video…";
COMPRESSING_VIDEO   = "Komprimuje sa video…";

//Generic formats are used for media with no Title. Eg: Photo Published

PUBLISHED_MEDIA_FORMAT  = "„%@“ zverejnené";
PUBLISHED_VIDEO         = "Video zverejnené";
PUBLISHED_IMAGE         = "Fotka zverejnená";

MEDIA_FAILURE_FORMAT    = "Nepodarilo sa zverejniť „%@“";
FAILED_PUBLISH_VIDEO    = "Nepodarilo sa zverejniť video.";
FAILED_PUBLISH_IMAGE    = "Nepodarilo sa zverejniť fotku.";

"VIEW_BUTTON_TITLE_FORMAT" = "Zobraziť na %@";
"TELL_A_FRIEND" = "Odporučiť";
"CLOSE" = "Zatvoriť";

"TRIM_FOR_MMS_TITLE" = "Odoslať";
"TRIM_FOR_EMAIL_TITLE" = "Odoslať emailom";
"TRIM_FOR_PUBLISH_TITLE" = "Zverejniť";

"TRIM_VIDEO_NAV_TITLE" = "Orezať video";
"TRIM_VIDEO_NAV_TITLE_IMAGE_PICKER" = "Upraviť video";
"TRIM_TITLE_IMAGE_PICKER" = "Uložiť";

"VIDEO_TOO_LONG_ALERT_TITLE" = "Video je príiš dlhé";
"VIDEO_TOO_LONG_MMS_BODY" = "Chcete na odoslanie vybrať kratší výrez z tohto videa?";
"VIDEO_TOO_LONG_EMAIL_BODY" = "Chcete na odoslanie emailom vybrať kratší výrez z tohto videa?";
"VIDEO_TOO_LONG_PUBLISH_BODY" = "Chcete na zverejnenie vybrať kratší výrez z tohto videa?";

"VIDEO_TOO_LONG_CANCEL" = "Zrušiť";
"VIDEO_TOO_LONG_OK" = "OK";

/*** Album View Button Labels  ***/
// These labels are displayed in the toolbar at the bottom of the album view after the Action icon is touched (iPhone) or in the nav bar after the action button is touched (iPad)

ADD_BUTTON          = "Pridať";
ADD_PHOTOS_BUTTON   = "Pridať fotky";
ADD_TO_BUTTON       = "Pridať";
ADD_TO_ELLIPSIS_BUTTON = "Pridať…";
SHARE_BUTTON        = "Zdieľať";
SHARE_BUTTON_FORMAT = "Zdieľať (%d)";
EMAIL_BUTTON        = "Odoslať emailom";
EMAIL_BUTTON_FORMAT = "Odoslať emailom (%d)";
COPY_BUTTON         = "Kopírovať";
COPY_BUTTON_FORMAT  = "Kopírovať (%d)";
MOVE_BUTTON         = "Pridať";
MOVE_BUTTON_FORMAT  = "Pridať do (%d)";
PRINT_BUTTON        = "Tlačiť";
PRINT_BUTTON_FORMAT = "Tlačiť (%d)";
REMOVE_BUTTON       = "Odstrániť";
REMOVE_BUTTON_FORMAT = "Odstrániť (%d)";
DELETE_BUTTON       = "Vymazať";
DELETE_BUTTON_FORMAT = "Vymazať (%d)";
SAVE_TO_CAMERAROLL_BUTTON = "Uložiť";
SAVE_TO_CAMERAROLL_SHEET_BUTTON = "Uložiť do albumu Fotoaparát";
SAVE_TO_SAVEDPHOTOS_SHEET_BUTTON = "Uložiť medzi Uložené fotky";

/***/

"TRIM_ALERT_TITLE" = "Orezať originál";
"TRIM_COPY_ALERT_TITLE" = "Uložiť nový výrez";

/* Error message displayed in an alert when the re encoding of a video is interrupted */
"SHARING_WAS_INTERRUPTED" = "Zdieľanie bolo prerušené";

/* Photo filename for emailed items */
"PHOTO_FILENAME" = "fotka";
"AUDIO_FILENAME" = "audio";

"PRINT_FILENAME" = "Fotka";

"VIDEO_TOO_LONG_TITLE" = "Video je príliš dlhé na odoslanie";
"VIDEO_TOO_LONG_TITLE_IMAGE_PICKER" = "Video je príiš dlhé";
"VIDEO_TOO_LONG_BODY" = "Vyberte menší výrez z tohto videa.";

"VIDEO_PLAYBACK_FAILED" = "Tento formát videa nie je podporovaný.";

/*** Bulk Editing ***/

// Navigation bar titles.

SELECT_PHOTOS       = "Vyberte fotky";
SELECT_VIDEOS       = "Vyberte videá";
SELECT_AUDIOS       = "Vyberte audio súbory";
SELECT_ITEMS        = "Vyberte položky";

SELECTED_PHOTO      = "1 označená fotka";
SELECTED_PHOTOS     = "Označené fotky: %d";

SELECTED_VIDEO      = "1 označené video";
SELECTED_VIDEOS     = "Označené videá: %d";

SELECTED_AUDIO      = "1 označený audio súbor";
SELECTED_AUDIOS     = "Označené audio súbory: %d";

SELECTED_ITEM       = "1 označená položka";
SELECTED_ITEMS      = "Označené položky: %d";

// Move Action sheet labels

MOVE_TO_EXISTING_ALBUM = "Presunúť do existujúceho albumu";
ADD_TO_EXISTING_ALBUM  = "Do existujúceho albumu";
ADD_TO_NEW_ALBUM       = "Do nového albumu";

// Remove confirmation button labels and prompts.

REMOVE_FROM_ALBUM_BUTTON   = "Odstrániť z albumu";

REMOVE_CONF_TITLE_PHOTO    = "Táto fotka bude odstránená z tohto albumu, zostane však vo vašom fotoarchíve.";
REMOVE_CONF_TITLE_PHOTOS   = "Tieto fotky budú odstránené z tohto albumu, zostanú však vo vašom fotoarchíve.";

REMOVE_CONF_TITLE_VIDEO    = "Toto video bude odstránené z tohto albumu, zostane však vo vašom fotoarchíve.";
REMOVE_CONF_TITLE_VIDEOS   = "Tieto videá budú odstránené z tohto albumu, zostanú však vo vašom fotoarchíve.";

REMOVE_CONF_TITLE_AUDIO    = "Tento audio klip bude odstránený z tohto albumu, zostane však vo vašom fotoarchíve.";
REMOVE_CONF_TITLE_AUDIOS   = "Tieto audio klipy budú odstránené z tohto albumu, zostanú však vo vašom fotoarchíve.";

REMOVE_CONF_TITLE_ITEM     = "Táto položka bude odstránená z tohto albumu, zostane však vo vašom fotoarchíve.";
REMOVE_CONF_TITLE_ITEMS    = "Tieto položky budú odstránené z tohto albumu, zostanú však vo vašom fotoarchíve.";

REMOVE_ALL                 = "Odstrániť všetky";
REMOVE_ALL_INCLUDING_ALBUM = "Odstrániť všetky";


// Delete confirmation button labels.

DELETE_PHOTO        = "Vymazať fotku";
DELETE_PHOTOS       = "Vymazať označené fotky";

DELETE_VIDEO        = "Vymazať video";
DELETE_VIDEOS       = "Vymazať označené videá";

DELETE_AUDIO        = "Vymazať audio";
DELETE_AUDIOS       = "Vymazať označené audio súbory";

DELETE_ITEM         = "Vymazať položku";
DELETE_ITEMS        = "Vymazať označené položky";

DELETE_MEDIA        = "Vymazať médiá";
DELETE_MEDIAS       = "Vymazať označené médiá";

DELETE_ALL          = "Vymazať všetky";
DELETE_ALL_INCLUDING_ALBUM = "Vymazať všetky";
    // Displayed when an album or event will be deleted in addition to deleting all the photos within the album or event.

DELETE_CONF_TITLE   = "Vymazať sa dajú len položky importované priamo do iPadu.";

// Deleting photos that are referenced from albums
DELETE_EVERYWHERE                               = "Vymazať všade";

DELETE_EVERYWHERE_CONF_TITLE_PHOTO_1_ALBUM      = "Táto fotka sa používa v albume.\nChcete ju všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_PHOTO_N_ALBUMS     = "Táto fotka sa používa v albumoch (%@).\nChcete ju všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_PHOTOS_1_ALBUM     = "Tieto fotky sa používajú v albume.\nChcete ich všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_PHOTOS_N_ALBUMS    = "Tieto fotky sa používajú v albumoch (%@).\nChcete ich všade vymazať?";

DELETE_EVERYWHERE_CONF_TITLE_VIDEO_1_ALBUM      = "Toto video sa používa v albume.\nChcete ho všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_VIDEO_N_ALBUMS     = "Toto video sa používa v albumoch (%@).\nChcete ho všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_VIDEOS_1_ALBUM     = "Tieto videá sa používajú v albume.\nChcete ich všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_VIDEOS_N_ALBUMS    = "Tieto videá sa používajú v albumoch (%@).\nChcete ich všade vymazať?";

DELETE_EVERYWHERE_CONF_TITLE_AUDIO_1_ALBUM      = "Tento audio klip sa používa v albume.\nChcete ho všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_AUDIO_N_ALBUMS     = "Tento audio klip sa používa v albumoch (%@).\nChcete ho všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_AUDIOS_1_ALBUM     = "Tieto audio klipy sa používajú v albume.\nChcete ich všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_AUDIOS_N_ALBUMS    = "Tieto audio klipy sa používajú v albumoch (%@).\nChcete ich všade vymazať?";

DELETE_EVERYWHERE_CONF_TITLE_ITEM_1_ALBUM       = "Táto položka sa používa v albume.\nChcete ju všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_ITEM_N_ALBUMS      = "Táto položka sa používa v albumoch (%@).\nChcete ju všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_ITEMS_1_ALBUM      = "Tieto položky sa používajú v albume.\nChcete ich všade vymazať?";
DELETE_EVERYWHERE_CONF_TITLE_ITEMS_N_ALBUMS     = "Tieto položky sa používajú v albumoch (%@).\nChcete ich všade vymazať?";

/*** Import ***/

// Navigation bar button labels.

IMPORT              = "Importovať";
IMPORT_ALL          = "Importovať všetky";
IMPORT_SELECTED     = "Importovať označené";

DELETE_SELECTED     = "Vymazať označené";

STOP_IMPORT         = "Zastaviť importovanie";

// ***

"FREE_SPACE_TITLE" = "Nedostatok miesta";
"FREE_SPACE_MESSAGE" = "Importovanie vyžaduje o %@ viac miesta. Vyberte menej položiek, alebo uvoľnite miesto vymazaním videí, fotiek alebo skladieb.";

"NO_SPACE_MESSAGE_iPhone" = "Na tomto iPhone nie je dostatok voľného miesta pre importovanie fotiek.";
"NO_SPACE_MESSAGE_iPod" = "Na tomto iPode nie je dostatok voľného miesta pre importovanie fotiek.";
"NO_SPACE_MESSAGE_iPad" = "Na tomto iPade nie je dostatok voľného miesta pre importovanie fotiek.";

"IMPORT_COMPLETE_TITLE" = "Importovanie dokončené";
"IMPORT_STOPPED_TITLE" = "Importovanie zastavené";

"KEEPORDELETE_PHOTO_iPhone" = "Chcete vymazať importovanú fotku z pripojeného iPhonu?";
"KEEPORDELETE_PHOTOS_iPhone" = "Chcete vymazať importované fotky z pripojeného iPhonu?";
"KEEPORDELETE_VIDEO_iPhone" = "Chcete vymazať importované video z pripojeného iPhonu?";
"KEEPORDELETE_VIDEOS_iPhone" = "Chcete vymazať importované videá z pripojeného iPhonu?";
"KEEPORDELETE_MEDIA_iPhone" = "Chcete vymazať importované médiá z pripojeného iPhonu?";

"KEEPORDELETE_PHOTO_iPod" = "Chcete vymazať importovanú fotku z pripojeného iPodu?";
"KEEPORDELETE_PHOTOS_iPod" = "Chcete vymazať importované fotky z pripojeného iPodu?";
"KEEPORDELETE_VIDEO_iPod" = "Chcete vymazať importované video z pripojeného iPodu?";
"KEEPORDELETE_VIDEOS_iPod" = "Chcete vymazať importované videá z pripojeného iPodu?";
"KEEPORDELETE_MEDIA_iPod" = "Chcete vymazať importované médiá z pripojeného iPodu?";

"KEEPORDELETE_PHOTO_iPad" = "Chcete vymazať importovanú fotku z pripojeného iPadu?";
"KEEPORDELETE_PHOTOS_iPad" = "Chcete vymazať importované fotky z pripojeného iPadu?";
"KEEPORDELETE_VIDEO_iPad" = "Chcete vymazať importované video z pripojeného iPadu?";
"KEEPORDELETE_VIDEOS_iPad" = "Chcete vymazať importované videá z pripojeného iPadu?";
"KEEPORDELETE_MEDIA_iPad" = "Chcete vymazať importované médiá z pripojeného iPadu?";

"KEEPORDELETE_PHOTO_Camera" = "Chcete vymazať importovanú fotku z pripojeného fotoaparátu?";
"KEEPORDELETE_PHOTOS_Camera" = "Chcete vymazať importované fotky z pripojeného fotoaparátu?";
"KEEPORDELETE_VIDEO_Camera" = "Chcete vymazať importované video z pripojeného fotoaparátu?";
"KEEPORDELETE_VIDEOS_Camera" = "Chcete vymazať importované videá z pripojeného fotoaparátu?";
"KEEPORDELETE_MEDIA_Camera" = "Chcete vymazať importované médiá z pripojeného fotoaparátu?";

"KEEPORDELETE_PHOTO_FORMAT" = "Chcete vymazať importovanú fotku z '%@'?";
"KEEPORDELETE_PHOTOS_FORMAT" = "Chcete vymazať importované fotky z '%@'?";
"KEEPORDELETE_VIDEO_FORMAT" = "Chcete vymazať importované video z '%@'?";
"KEEPORDELETE_VIDEOS_FORMAT" = "Chcete vymazať importované videá z '%@'?";
"KEEPORDELETE_MEDIA_FORMAT" = "Chcete vymazať importované médiá z '%@'?";

"KEEP" = "Ponechať";
"REMOVE" = "Vymazať";
"IGNORE_DUPLICATES" = "Preskočiť duplikáty";
"IMPORT_DUPS" = "Duplicitné fotky";
"IMPORT_DUPS_MSG" = "Niektoré z týchto fotiek už existujú vo vašom fotoarchíve.";
"IMPORT_DUPS_ALL_MSG" = "Všetky tieto fotky už existujú vo vašom fotoarchíve.";
"UNLOCK_DEVICE_iPhone" = "Pre importovanie fotiek odomknite iPhone";
"UNLOCK_DEVICE_iPod" = "Pre importovanie fotiek odomknite iPod";
"UNLOCK_DEVICE_iPad" = "Pre importovanie fotiek odomknite iPad";

"IMPORT_MULTI_ALERT_TITLE" = "Viacero formátov naimportovaných";
"IMPORT_MULTI_ALERT_MESSAGE" = "Fotostream odošle len jednu verziu každej z týchto položiek.";

// Shorter form of "Import All" for the confirmation dialog
IMPORT_ALL_SHORT          = "Importovať všetky";

"CAMERA_DEVICE_TYPE" = "Fotoaparát";

"IMPORT_LOADING_STRING" = "Načítava sa…";

"IMPORT_EMPTY_DEVICE_TITLE" = "Žiadne fotky na importovanie";
"IMPORT_EMPTY_DEVICE_MESSAGE" = "";

/* Error string for when an image from an external camera fails to download */
"CAMERA_IMPORT_DOWNLOAD_FAILED" = "Sťahovanie fotky zlyhalo.";

/* Error string for when an image from an external camera fails to import */
"CAMERA_IMPORT_IMPORT_FAILED" = "Importovanie fotky zlyhalo.";

/* Wildcat PLUIImageViewController */
"CHOOSE_PHOTO_TITLE" = "Vybrať fotku";
"CHOOSE_VIDEO_TITLE" = "Vybrať video";
"USE_PHOTO_BUTTON_TITLE" = "Použiť";


"PROGRESS_SYNCING_X_OF_Y" = "Synchronizuje sa %@ z %@";
"PROGRESS_IMPORTING_X_OF_Y" = "Obnovuje sa %@ z %@";
"PROGRESS_DOWNLOADING_X_OF_Y" = "Sťahuje sa %@ z %@";
"PROGRESS_SYNCING_AND_IMPORTING_X_OF_Y" = "Synchronizuje sa %@ z %@";
"PROGRESS_SYNCING_AND_DOWNLOADING_X_OF_Y" = "Synchronizuje sa %@ z %@";
"PROGRESS_IMPORTING_AND_DOWNLOADING_X_OF_Y" = "Sťahuje sa %@ z %@";
"PROGRESS_ALL_X_OF_Y" = "Synchronizuje sa %@ z %@";


/*** Full Screen ***/

// Navigation bar button labels.

SLIDESHOW = "Prezentácia";

/*** Slideshow Settings ***/

"SLIDESHOW_SETTINGS_TITLE" = "Možnosti prezentácie";
"TRANSITIONS" = "Prechody";
"PLAY_MUSIC" = "Prehrať hudbu";
"SELECTED_MUSIC" = "Hudba";
"NO_MUSIC_SELECTED" = "Žiadna";
"START_SLIDESHOW" = "Spustiť prezentáciu";

/* Slideshow Transitions */
"TRANSITION" = "Prechod";
"CUBE" = "Kocka";
"DISSOLVE" = "Prelínať";
"RIPPLE" = "Zvlniť";
"WIPE" = "Stieračka";
"ORIGAMI" = "Origami";
"WIPEACROSS" = "Zotrieť cez";
"WIPEDOWN" = "Zotrieť nadol";

/* K66 Transitions as of Durango */
"KenBurns" = "Ken Burns";
"Origami" = "Origami";
"Reflections" = "Odrazy";
"Vintage Prints" = "Staré fotky";
"Snapshots" = "Momentky";
"PhotoMobile" = "Zavesené fotky";
"HolidayMobile" = "Dovolenka";
"Shatter" = "Rozbité";
"Places" = "Miesta";
"Classic" = "Klasická";
"Scrapbook" = "Pamätníček";
"SlidingPanels" = "Pohyblivé panely";

/* Flash settings */
"FLASH_AUTO" = "Auto";
"FLASH_OFF" = "Vyp.";
"FLASH_ON" = "Zap.";
"FLASH_HDR" = "HDR";

"HDR_ON" = "HDR Zap.";
"HDR_OFF" = "HDR Vyp.";

/* Places */
"PLACES" = "Miesta";
"PHOTOS_SINGULAR" = "Jedna fotka";
"PHOTOS_PLURAL"   = "Fotky: %@";

/* New Wallpaper */
"SET_LOCK_SCREEN" = "Na zamknutú plochu";
"SET_HOME_SCREEN" = "Na plochu";
"SET_BOTH" = "Nastaviť na obe";

/* Message when publish albums are loading */
"LOADING_ALBUMS" = "Načítava sa…";

/* The name of places albums depends on their content */
"PLACE_ALBUM_TITLE_ONLY_PHOTOS_SINGULAR" = "Jedna fotka";
"PLACE_ALBUM_TITLE_ONLY_PHOTOS_PLURAL"   = "Fotky: %@";
"PLACE_ALBUM_TITLE_ONLY_VIDEOS_SINGULAR" = "Jedno video";
"PLACE_ALBUM_TITLE_ONLY_VIDEOS_PLURAL"   = "Videá: %@";
"PLACE_ALBUM_TITLE_PHOTOS_AND_VIDEOS"    = "Položiek: %@";

/* Strings used for displaying the HDR alert */
"HDR_ALERT_TITLE" = "Nastavenia HDR";
"HDR_ALERT_MESSAGE" = "Bude uložená pôvodná a aj HDR verzia každej fotky. Túto možnosť môžete upraviť v Nastaveniach.";
"HDR_ALERT_SETTINGS_BUTTON_TITLE" = "Nastavenia";
"HDR_ALERT_DISMISS_BUTTON_TITLE" = "Zrušiť";

/* HDR HUD */
"SAVING_HDR" = "Ukladá sa HDR";

/* Camera Options */
"OPTIONS_BUTTON_TITLE" = "Možnosti";
"OPTIONS_DONE_BUTTON_TITLE" = "Hotovo";
"GRID_OPTION" = "Mriežka";
"HDR_OPTION" = "HDR";

/* Camera AE/AF Lock */
"AEAF_LOCK_TEXT" = "Zámok AE/AF";
"AE_LOCK_TEXT" = "Zámok AE";
"AF_LOCK_TEXT" = "Zámok AF";

/* Title for AirTunes Popover */
"AIR_PLAY" = "AirPlay";
"AIRTUNES_PASSWORD_ALERT_TITLE" = "AirPlay heslo";
"AIRTUNES_PASSWORD_ALERT_MESSAGE_FORMAT" = "Zadajte heslo pre „%@“";
"PASSWORD_ALERT_PLACEHOLDER" = "Heslo";

/*Message for view on device when slideshow is playing on airtunes*/
"AIR_PLAY_SLIDESHOW_MESSAGE_FORMAT" = "Táto prezentácia sa prehráva na „%@“.";
"AIR_PLAY_MOVIE_MESSAGE_FORMAT" = "Tento film sa prehráva na „%@“.";
